app/controllers/articles_controller.rb

  def index
    @articles = Article.order 'created_at DESC'
---
SELECT "articles".* FROM "articles"  ORDER BY created_at DESC

  def show
    @article = Article.find(params[:id])
    @comments = Comment.order 'created_at DESC'
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "post1"], ["text", "post"], ["created_at", "2016-04-14 13:43:25.105348"], ["updated_at", "2016-04-14 13:43:25.105348"]]