app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.new do |c|
      c.author = current_user.username.capitalize!
      c.body = comment_params[:body]
    end
    @comment.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("article_id", "author", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["article_id", 1], ["author", "Dinar"], ["body", "post comment"], ["created_at", "2016-04-14 13:43:34.159044"], ["updated_at", "2016-04-14 13:43:34.159044"]]