app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("email", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "eifdj@mail.ru"], ["message", "lkdjsf"], ["created_at", "2016-08-17 20:01:09.953138"], ["updated_at", "2016-08-17 20:01:09.953138"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.valid?
      @contact.save